Tekla Open API Reference for Tekla Structures 2025
Cloud Constructor
Overload List
Name | Description
Cloud(ViewBase, PointList)
 Creates a new cloud instance with a point list using standard attributes.
Cloud(ViewBase, PointList, Cloud.CloudAttributes)
 Creates a new cloud instance with a point list using the given attributes.
Top
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace